# Temperature Rating Properties

Source: https://www.revitapidocs.com/2026/18977d18-dc94-c6f6-a577-b75d8becdbf1.htm

---

| Temperature Rating Properties |
| --- |

The TemperatureRating type exposes the following members.

Properties

|  | Name | Description |
| --- | --- | --- |
|  | Id | The Conductor Temperature Rating id. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Name | The Conductor Temperature Rating name. |

Top See Also

#### Reference

TemperatureRating Class Autodesk.Revit.DB.Electrical Namespace